function [img]=ila6_n(x1,x2,x3,x4,x5,x6,fx1,fx2,fx3,fx4,fx5,fx6)
%用于秘钥分享的拉格朗日方程组解密@lxy

img=-6*(fx1.*x2.*x3.*x4.*x5.*x6./((x1-x2).*(x1-x3).*(x1-x4).*(x1-x5).*(x1-x6))+x1.*fx2.*x3.*x4.*x5.*x6./((x2-x1).*(x2-x3).*(x2-x4).*(x2-x5).*(x2-x6))+x1.*x2.*fx3.*x4.*x5.*x6./((x3-x1).*(x3-x2).*(x3-x4).*(x3-x5).*(x3-x6))+x1.*x2.*x3.*fx4.*x5.*x6./((x4-x1).*(x4-x2).*(x4-x3).*(x4-x5).*(x4-x6))+x1.*x2.*x3.*x4.*fx5.*x6./((x5-x1).*(x5-x2).*(x5-x3).*(x5-x4).*(x5-x6))+x1.*x2.*x3.*x4.*x5.*fx6./((x6-x1).*(x6-x2).*(x6-x3).*(x6-x4).*(x6-x5)));
end