function [fx1,fx2,fx3,fx4,fx5,fx6,fx7,fx8] =la6_n(y,x1,x2,x3,x4,x5,x6,x7,x8)
%用于秘钥分享的拉格朗日方程组加密@lxy

[M,N]=size(y);
m1=rand(M,N)/6;
m2=rand(M,N)/6;
m3=rand(M,N)/6;
m4=rand(M,N)/6;
m5=rand(M,N)/6;

fx1=y/6+m1.*x1+m2.*x1.^2+m3.*x1.^3+m4.*x1.^4+m5.*x1.^5;
fx2=y/6+m1.*x2+m2.*x2.^2+m3.*x2.^3+m4.*x2.^4+m5.*x2.^5;
fx3=y/6+m1.*x3+m2.*x3.^2+m3.*x3.^3+m4.*x3.^4+m5.*x3.^5;
fx4=y/6+m1.*x4+m2.*x4.^2+m3.*x4.^3+m4.*x4.^4+m5.*x4.^5;
fx5=y/6+m1.*x5+m2.*x5.^2+m3.*x5.^3+m4.*x5.^4+m5.*x5.^5;
fx6=y/6+m1.*x6+m2.*x6.^2+m3.*x6.^3+m4.*x6.^4+m5.*x6.^5;
fx7=y/6+m1.*x7+m2.*x7.^2+m3.*x7.^3+m4.*x7.^4+m5.*x7.^5;
fx8=y/6+m1.*x8+m2.*x8.^2+m3.*x8.^3+m4.*x8.^4+m5.*x8.^5;
end